# Document   : messages.properties
# Created on : 20 Nov 2023, 12:28
# Author     : Kyle Roberts
# Updated: Quinn Toye 05 Dec 2023, 15:21:00
# Updated Description: Added messages for new pages

label.welcome = Bienvenue
label.chooseRequestLocale = D\u00e9finir les param\u00e8tres r\u00e9gionaux de la demande
label.requestLocaleContent = Cette page utilise les param\u00e8tres r\u00e9gionaux d\u00e9finis dans le param\u00e8tre request.
label.changeLang = Modifier les langues de la page en cours

label.lang.en = Anglais
label.lang.de = Allemand
label.lang.fr = Fran\u00e7ais

label.chooseSessionLocale = D\u00e9finir les param\u00e8tres de session
label.sessionLocaleContent = Cette page utilise les param\u00e8tres r\u00e9gionaux d\u00e9finis dans la session.
label.sessionChangeSuccess = Les param\u00e8tres r\u00e9gionaux de la session ont \u00e9t\u00e9 modifi\u00e9s avec succ\u00e8s.

label.chooseCookieLocale = D\u00e9finir les param\u00e8tres r\u00e9gionaux des cookies
label.cookieLocaleContent = Cette page utilise les param\u00e8tres r\u00e9gionaux d\u00e9finis dans le cookie.
label.cookieChangeSuccess = Les param\u00e8tres r\u00e9gionaux du cookie ont \u00e9t\u00e9 modifi\u00e9s avec succ\u00e8s.
label.viewPage = Aller \u00e0 la page d'exemple
label.back = Retour

# header JSP
label.home = Maison
label.map = Map
label.openMap = Ouvrir la carte
label.addOrEditMap = Ajouter/Modifier une carte
label.about = \u00c0 propos
label.contact = Contact
label.changeLanguage = Changer de langue
label.manageUsers = G\u00e9rer les utilisateurs
label.manageCatalogue = G\u00e9rer le catalogue
label.loginOrCreateAccount = Connectez vous ou cr\u00e9ez un nouveau compte
label.admin = Administrateur
label.logout = Se d\u00e9connecter
label.userProfile = Profil de l'utilisateur
label.termsAndConditionsHeader = Termes et Conditions

# map JSP
label.theMap = La carte
label.requestLocation = Obtenir ma position!
label.requestLocationBtn = Aller!
label.noBrowserSupport = La g\u00e9olocalisation n'est pas prise en charge par ce navigateur.
label.geoLocationPermDenied = L'utilisateur a refus\u00e9 la demande de g\u00e9olocalisation.
label.locationUnavailable = Les informations de localisation ne sont pas disponibles.
label.locationReqTimeout = La demande d'obtention de la localisation de l'utilisateur a expir\u00e9.
label.unknownError = Une erreur inconnue est survenue.

# ViewModifyPoint JSP
label.mapPointCreateorUpdate = Cr\u00e9ation ou mise \u00e0 jour d'un point de carte
label.attribute = Attribut
label.value = Valeur
label.id = ID
label.name = Nom
label.description = Description
label.category = Cat\u00e9gorie
label.latitude = Latitude
label.longitude = Longitude
label.photoURL = PhotoURL
label.modifyCreateBtn = Modifier/Cr\u00e9er un point
label.updatePhoto = Mettre \u00e0 jour la photo
label.photo = Photo:

#changeLocaleSpring JSP
label.chooseLanguage = Choisissez la langue i18n

# PointListJSP JSP
label.mapPoints = Points de la carte
label.modifyBtn = Modifier un point
label.deleteBtn = Supprimer un point
label.addBtn = Ajouter un point

# footer JSP
label.usefulLinks = Liens utiles:

# index JSP
label.teamMemberRoles = Membres de l'\u00e9quipe et r\u00f4les:
label.backEnd = Back-End
label.clientSide = C\u00f4t\u00e9 client

# users JSP
label.showing = Affichage
label.users = Utilisateurs:
label.username = Nom d'utilisateur
label.firstName = Pr\u00e9nom
label.secondName = Nom de famille
label.status = Statut
label.role = R\u00f4le
label.modifyUsersBtn = Modifier l'utilisateur
label.addUsersBtn = Ajouter un utilisateur

# createAccount JSP
label.createAccount = Cr\u00e9er un compte
label.userNameUniqueMessage = Le nom d'utilisateur doit \u00eatre unique et le mot de passe doit comporter au moins 8 caract\u00e8res
label.password = Mot de passe
label.confirmPassword = Confirmez le mot de passe
label.continue = Continuer

# register JSP
label.reEnterPassword = Entrez \u00e0 nouveau le mot de passe

# login JSP
label.login = Se connecter
label.createNewAccount = Cr\u00e9er un nouveau compte

# viewModifyUser JSP
label.userDetails = D\u00e9tails de l'utilisateur
label.userId = ID de l'utilisateur
label.houseNumber = Num\u00e9ro de maison
label.addressLineOne = Adresse Ligne 1
label.addressLineTwo = Adresse Ligne 2
label.city = Ville
label.county = Comt\u00e9
label.country = Pays
label.postcode = Code postal
label.telephone = T\u00e9l\u00e9phone
label.mobile = Mobile
label.userStatusAndRole = Statut et r\u00f4le de l'utilisateur
label.manageUserStatusAndRole = G\u00e9rer le statut et le r\u00f4le de l'utilisateur
label.enabled = Activ\u00e9
label.updateUser = Mettre \u00e0 jour l'utilisateur
label.update = Mise \u00e0 jour
label.updatePassword = Mettre \u00e0 jour le mot de passe
label.returnToUsers = Retour aux utilisateurs

# createAccountDetails JSP
label.usernameAndPasswordAccepted = Nom d'utilisateur et mot de passe accept\u00e9s
label.pleaseAddAcountDetailsBelow = Veuillez ajouter les d\u00e9tails du compte ci-dessous
label.accountCreationFailed = \u00c9chec de la cr\u00e9ation du compte
label.tryAgain = Essayer \u00e0 nouveau!

# termsAndConditions JSP
label.termsIntroHead = 1. Introduction
label.termsIntroContent = Bienvenue sur notre site Web 'Insert Team Name Here - Map Application'. Nous nous engageons \u00e0 prot\u00e9ger votre confidentialit\u00e9 et souhaitons \u00eatre transparents sur la mani\u00e8re dont nous collectons, utilisons et partageons vos informations personnelles.
label.termsCollectHead = 2. Quelles informations collectons-nous ?
label.termsCollectSubHead = Nous recueillons les types suivants d'informations personnelles aupr\u00e8s de vous :
label.termsCollectLi1 = Informations que vous nous fournissez directement:\u00a0Cela comprend les informations que vous fournissez lors de la cr\u00e9ation d'un compte, de l'inscription \u00e0 des \u00e9v\u00e9nements ou de la prise de contact avec nous. Ces informations peuvent inclure votre nom, adresse e-mail, num\u00e9ro de t\u00e9l\u00e9phone, adresse et autres informations personnelles.
label.termsCollectLi2 = Informations que nous collectons automatiquement:\u00a0Lorsque vous visitez notre site Web, nous pouvons collecter certaines informations sur votre appareil, telles que votre adresse IP, votre navigateur et votre syst\u00e8me d'exploitation. Nous pouvons \u00e9galement collecter des informations sur vos interactions avec notre site Web, telles que les pages que vous visitez et les liens que vous cliquez.
label.termsCollectLi3 = Les informations que vous nous fournissez directement : Cela comprend les informations que vous fournissez lorsque vous cr\u00e9ez un compte, vous inscrivez \u00e0 des \u00e9v\u00e9nements ou communiquez avec nous. Ces informations peuvent inclure votre nom, votre adresse e-mail, votre num\u00e9ro de t\u00e9l\u00e9phone, votre adresse, votre emplacement et d'autres informations personnelles
label.termsUseHead = 3. Comment utilisons-nous vos donn\u00e9es ?
label.termsUseSubHead = Nous utilisons vos donn\u00e9es aux fins suivantes :
label.termsUseLi1 = Fourniture de nos services:\u00a0Cela inclut la fourniture d'acc\u00e8s \u00e0 notre site Web, le traitement de vos transactions et la communication avec vous concernant votre compte.
label.termsUseLi2 = Am\u00e9lioration de nos services:\u00a0Nous utilisons vos donn\u00e9es pour am\u00e9liorer notre site Web, nos produits et nos services.
label.termsUseLi3 = Personnalisation de votre exp\u00e9rience:\u00a0Nous utilisons vos donn\u00e9es pour personnaliser votre exp\u00e9rience sur notre site Web, par exemple en vous fournissant des recommandations personnalis\u00e9es.
label.termsUseLi4 = Envoi de communications marketing:\u00a0Nous pouvons vous envoyer des communications marketing sur nos produits et services. Vous pouvez vous d\u00e9sinscrire de nos communications marketing \u00e0 tout moment en cliquant sur le lien de d\u00e9sabonnement figurant dans chaque e-mail que nous vous envoyons.
label.termsUseLi5 = Respect de la loi et des r\u00e8glements:\u00a0Nous pouvons utiliser vos donn\u00e9es pour nous conformer aux lois et r\u00e8glements applicables, tels que les lois sur la protection des donn\u00e9es.
label.termsUseLi6 = Protection de nos droits:\u00a0Nous pouvons utiliser vos donn\u00e9es pour prot\u00e9ger nos droits et notre propri\u00e9t\u00e9, par exemple en faisant respecter nos conditions d'utilisation.
label.termsShareHead = 4. Comment partageons-nous vos donn\u00e9es ?
label.termsShareSubHead = Nous pouvons partager vos donn\u00e9es avec les tiers suivants :
label.termsShareLi1 = Nos prestataires de services:\u00a0Nous pouvons partager vos donn\u00e9es avec nos prestataires de services, tels que les h\u00e9bergeurs et les agences de marketing. Nos prestataires de services sont tenus d'utiliser vos donn\u00e9es uniquement pour nous fournir des services et ne sont pas autoris\u00e9s \u00e0 les partager avec des tiers.
label.termsShareLi2 = Autres tiers:\u00a0Nous pouvons partager vos donn\u00e9es avec d'autres tiers, tels que des partenaires commerciaux ou des partenaires marketing. Nous ne partagerons vos donn\u00e9es qu'avec des tiers qui se sont engag\u00e9s \u00e0 prot\u00e9ger vos donn\u00e9es conform\u00e9ment \u00e0 cette politique de confidentialit\u00e9.
label.termsChoicesHead = 5. Vos choix
label.termsChoicesSubHead = Vous avez plusieurs choix concernant l'utilisation de vos donn\u00e9es :
label.termsChoicesLi1 = Vous pouvez vous d\u00e9sinscrire de nos communications marketing en cliquant sur le lien de d\u00e9sabonnement figurant dans chaque e-mail que nous vous envoyons.
label.termsChoicesLi2 = Vous pouvez nous demander de supprimer vos donn\u00e9es en nous contactant \u00e0 4toyeq57@solent.ac.uk.
label.termsChoicesLi3 = Vous pouvez nous demander de restreindre notre utilisation de vos donn\u00e9es en nous contactant \u00e0 '4toyeq57@solent.ac.uk'.
label.termsProtectHead = 6. Comment prot\u00e9geons-nous vos donn\u00e9es ?
label.termsProtectContent = Nous prenons des mesures de s\u00e9curit\u00e9 raisonnables pour prot\u00e9ger vos donn\u00e9es contre un acc\u00e8s, une utilisation, une divulgation, une alt\u00e9ration ou une destruction non autoris\u00e9s. Ces mesures incluent des mesures de s\u00e9curit\u00e9 physiques, techniques et administratives.
label.termsRightsHead = 7. Vos droits
label.termsRightsSubHead = Vous disposez de certains droits en vertu des lois sur la protection des donn\u00e9es, notamment le droit de :
label.termsRightsLi1 = Acc\u00e9der \u00e0 vos donn\u00e9es:\u00a0Vous avez le droit d'acc\u00e9der aux donn\u00e9es personnelles que nous d\u00e9tenons \u00e0 votre sujet.
label.termsRightsLi2 = Rectifier vos donn\u00e9es:\u00a0Vous avez le droit de faire rectifier vos donn\u00e9es personnelles si elles sont inexactes ou incompl\u00e8tes.
label.termsRightsLi3 = Supprimer vos donn\u00e9es:\u00a0Vous avez le droit de faire effacer vos donn\u00e9es personnelles dans certaines circonstances.
label.termsRightsLi4 = Limiter notre utilisation de vos donn\u00e9es:\u00a0Vous avez le droit de limiter notre utilisation de vos donn\u00e9es personnelles dans certaines circonstances.
label.termsRightsLi5 = Portabilit\u00e9 de vos donn\u00e9es:\u00a0Vous avez le droit de recevoir vos donn\u00e9es personnelles dans un format structur\u00e9
label.termsRightsLi6 = Portabilit\u00e9 de vos donn\u00e9es: Vous avez le droit de recevoir vos donn\u00e9es personnelles dans un format structur\u00e9
label.termsRightsContact = Pour exercer ces droits, veuillez nous contacter \u00e0 4toyeq57@solent.ac.uk.
label.termsChangesHead = 8. Modifications de cette politique de confidentialit\u00e9
label.termsChangesContent = Nous pouvons mettre \u00e0 jour cette politique de confidentialit\u00e9 de temps \u00e0 autre. Nous vous informerons de tout changement important en publiant la politique de confidentialit\u00e9 mise \u00e0 jour sur notre site Web.


